export const HISTORY_LIST = [{
    id: 7,
    title: '“西邮开源社”上线，整合 Q 群并宣传',
    date: '2019-xx-xx',
    text: [
        '- 正式将“西邮前端圈”更名为“西邮开源社”。',
        '- 正式将所有社区 Q 群整合至“西邮开源社”Q 群。',
        '- 打印此“关于开源社”页面成图片并进行讲解与宣传。',
        '- 将早期“西邮前端圈”版本代码归档为 v0.0.1。',
        '- 将本次“西邮开源社”版本代码归档为 v1.0.0。'
    ]
}, {
    id: 6,
    title: '梳理灵感链，打造“西邮开源社”新品牌',
    date: '2019-03-06',
    text: [
        '- 规划整合所有社区 Q 群，打造社区新品牌。',
        '  - 社区将以“西邮开源社”为名，助力西邮技术蓬勃发展。',
        '- 重构原型图，回归本心，着重保留如下三大展示页面：',
        '  - “西邮开源社”、“西邮实验室”与“关于开源社”。',
        '- 重构项目源代码，正式选择 Vue.js 全家桶进行开发。'
    ]
}, {
    id: 5,
    title: '“西邮区块链”Q 群助力校内分享活动',
    date: '2018-12-05',
    text: [
        '- 建立“西邮区块链”Q 群，帮助“Node 区块链加速器”宣校内分享活动。',
        '- 这段期间还在各大群宣传了很多西安的技术活动，如下：',
        '  - 宣传了牵头组织的“2018 西安 Web 前端交流大会”。',
        '  - 前端大会联络了诸多名企讲师，报名宣传覆盖度 1w+，到场百余人。',
        '  - 宣传了牵头组织的“2018 西安 Java 技术交流大会”。',
        '  - Java 大会重点邀请了校内外知名的陈莉君老师作为讲师之一。',
        '- 这段时间临时建立了仅有几人的“西邮产品圈”。'
    ]
}, {
    id: 4,
    title: '“西邮实验室”建立并宣传',
    date: '2018-08-22',
    text: [
        '- 时隔良久，建立“西邮实验室”Q 群正式宣传。',
        '- 将大二初期建立的“西邮学 C 辣”Q 群升级为“西邮后端圈”。',
        '- 带着学弟整理了一部分西邮实验室名单。'
    ]
}, {
    id: 3,
    title: '“西邮前端圈”上线及小步宣传',
    date: '2017-11-07',
    text: [
        '- 为项目购买域名并贡献自己租用的腾讯云主机。',
        '- 正式上线官网至 http://xupt-fe.top，此时只开放首页访问。',
        '- 群内宣传体验后修改部分 UI 样式问题。'
    ]
}, {
    id: 2,
    title: '“西邮前端圈”原型设计与后续分工',
    date: '2017-10-24',
    text: [
        '- 建立“西邮前端圈”官网开源仓库，向所有人开放',
        '- 在规划“西邮前端圈”中，新增三个功能（后期均未实现）：',
        ' - “前端资讯站”、”前端路线图“、“即刻编程”。',
        '- 使用 Mocking Bot 成功手绘六个页面的原型图。',
        '- 确定技术栈为原生 ES6 + 原生 CSS + Webpack 工程化。',
        '- 早期六人团队根据六个页面确定后续分工。'
    ],
}, {
    id: 1,
    title: '“西邮前端圈”从灵感到宣传',
    date: '2017-10-22',
    text: [
        '- 受同级校友之邀，参考“西电前端圈”，建立“西邮前端圈”。',
        '- 宣传“西邮前端圈” Q 群，今日达到 150 人。',
        '- 开启群内电子书、视频资料共享。',
        '- 确定首要产品主线——“西邮前端圈”官网，其中构思如下功能：',
        '  - “西邮前端圈”、“西邮实验室”、“关于前端圈”。',
        '- 宣传渠道有微信公众号文章、西邮各大 QQ 群和西邮置顶贴吧。'
    ]
}]